"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Распакаваць у гэту ж тэчку";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Распакаваць на Працоўны стол";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Распакаваць у...";
